controllers/PkuController.php

    protected function findModel($id)
    {
        if (($model = Pku::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `pku` WHERE `id`='9'